#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Monday-For-Theo/Monday-For-Theo/runs/run-sWbDHrYcZt9FKzHB

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_public_key.anvkey will be read during apply
 <= data "tls_public_key" "anvkey" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # aws_autoscaling_attachment.app1_asg_attachment will be created
  + resource "aws_autoscaling_attachment" "app1_asg_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.app1_asg will be created
  + resource "aws_autoscaling_group" "app1_asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 6
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 9
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "app1-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app1-instance"
        }
    }

  # aws_autoscaling_policy.app1_scaling_policy will be created
  + resource "aws_autoscaling_policy" "app1_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "app1-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "app1_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "app1_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.app1_LT will be created
  + resource "aws_launch_template" "app1_LT" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0453ec754f44f9a4a"
      + instance_type          = "t2.micro"
      + key_name               = "anvkey"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app1_LT"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBFQzIgaW5zdGFuY2U8L3RpdGxlPgo8L2hlYWQ+Cjxib2R5Pgo8ZGl2Pgo8aDE+RWFzdCBDb2FzdCBTYWl5YW5zISEhPC9oMT4KPGgxPkotRG9sbGEkIFRoYSBTYWl5YW4gR29kIG9mIERlc3RydWN0aW9uITwvaDE+CjxwPjxiPkluc3RhbmNlIE5hbWU6PC9iPiAkKGhvc3RuYW1lIC1mKSA8L3A+CjxwPjxiPkluc3RhbmNlIFByaXZhdGUgSXAgQWRkcmVzczogPC9iPiAkbG9jYWxfaXB2NDwvcD4KPHA+PGI+QXZhaWxhYmlsaXR5IFpvbmU6IDwvYj4gJGF6PC9wPgo8cD48Yj5WaXJ0dWFsIFByaXZhdGUgQ2xvdWQgKFZQQyk6PC9iPiAkdnBjPC9wPgo8L2Rpdj4KPC9ib2R5Pgo8aWZyYW1lIHNyYz0iaHR0cHM6Ly9naXBoeS5jb20vZW1iZWQvTU41UmFMTXZRR01qRVg5cXRrIiB3aWR0aD0iNDYyIiBoZWlnaHQ9IjQ4MCIgc3R5bGU9IiIgZnJhbWVCb3JkZXI9IjAiIGNsYXNzPSJnaXBoeS1lbWJlZCIgYWxsb3dGdWxsU2NyZWVuPjwvaWZyYW1lPjxwPjxhIGhyZWY9Imh0dHBzOi8vZ2lwaHkuY29tL2dpZnMvZ29nZXRhLXN1cGVyLXN0YXJkdXN0LWJyZWFrZXItTU41UmFMTXZRR01qRVg5cXRrIj52aWEgR0lQSFk8L2E+PC9wPgo8aWZyYW1lIHNyYz0iaHR0cHM6Ly9naXBoeS5jb20vZW1iZWQvdjZ2Rnlnb1g0ajVkZUxrakF2IiB3aWR0aD0iNDgwIiBoZWlnaHQ9IjI3NCIgc3R5bGU9IiIgZnJhbWVCb3JkZXI9IjAiIGNsYXNzPSJnaXBoeS1lbWJlZCIgYWxsb3dGdWxsU2NyZWVuPjwvaWZyYW1lPjxwPjxhIGhyZWY9Imh0dHBzOi8vZ2lwaHkuY29tL2dpZnMvVE9FSUFuaW1hdGlvblVLLWRyYWdvbi1iYWxsLXN1cGVyLWJyb2x5LXRvZWktYW5pbWF0aW9uLXY2dkZ5Z29YNGo1ZGVMa2pBdiI+dmlhIEdJUEhZPC9hPjwvcD4KPGlmcmFtZSBzcmM9Imh0dHBzOi8vZ2lwaHkuY29tL2VtYmVkL3loWFBGeWdTYU91em1ucTh0RiIgd2lkdGg9IjQ4MCIgaGVpZ2h0PSIyNzQiIHN0eWxlPSIiIGZyYW1lQm9yZGVyPSIwIiBjbGFzcz0iZ2lwaHktZW1iZWQiIGFsbG93RnVsbFNjcmVlbj48L2lmcmFtZT48cD48YSBocmVmPSJodHRwczovL2dpcGh5LmNvbS9naWZzL1RPRUlBbmltYXRpb25VSy1kcmFnb24tYmFsbC1zdXBlci1ibGFjay1nb2t1LXNhaXlhbi1yb3NlLXloWFBGeWdTYU91em1ucTh0RiI+dmlhIEdJUEhZPC9hPjwvcD4KPC9odG1sPgpIVE1MCgojIENsZWFuIHVwIHRoZSB0ZW1wIGZpbGVzCnJtIC1mIC90bXAvbG9jYWxfaXB2NCAvdG1wL2F6IC90bXAvbWFjaWQK"
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "app1_LT"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_lb.app1_alb will be created
  + resource "aws_lb" "app1_alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "app1-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name"    = "App1LoadBalancer"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + tags_all                   = {
          + "Name"    = "App1LoadBalancer"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.app1_tg will be created
  + resource "aws_lb_target_group" "app1_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "app1-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "App1TargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + tags_all                           = {
          + "Name"    = "App1TargetGroup"
          + "Owner"   = "User"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private"
        }
      + tags_all         = {
          + "Name" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public"
        }
      + tags_all         = {
          + "Name" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-east-1a will be created
  + resource "aws_route_table_association" "private-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1b will be created
  + resource "aws_route_table_association" "private-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1c will be created
  + resource "aws_route_table_association" "private-us-east-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1a will be created
  + resource "aws_route_table_association" "public-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1b will be created
  + resource "aws_route_table_association" "public-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1c will be created
  + resource "aws_route_table_association" "public-us-east-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.app1-lb01-sg01 will be created
  + resource "aws_security_group" "app1-lb01-sg01" {
      + arn                    = (known after apply)
      + description            = "app1-lb01-sg01"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Secure"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "app1-lb01-sg01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-lb01-sg01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-lb01-sg01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.app1-sg03-secure-server will be created
  + resource "aws_security_group" "app1-sg03-secure-server" {
      + arn                    = (known after apply)
      + description            = "app1-sg03-secure-server"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 514
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "app1-sg03-secure-server"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-sg03-secure-server"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-sg03-secure-server"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.app1-tg01-sg01 will be created
  + resource "aws_security_group" "app1-tg01-sg01" {
      + arn                    = (known after apply)
      + description            = "app1-tg01-sg01"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "icmp"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 8
            },
        ]
      + name                   = "app1-tg01-sg01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-tg01-sg01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-tg01-sg01"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-us-east-1a will be created
  + resource "aws_subnet" "private-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.131.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1b will be created
  + resource "aws_subnet" "private-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.131.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1c will be created
  + resource "aws_subnet" "private-us-east-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.131.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1a will be created
  + resource "aws_subnet" "public-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.131.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1b will be created
  + resource "aws_subnet" "public-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.131.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1c will be created
  + resource "aws_subnet" "public-us-east-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.131.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.app1 will be created
  + resource "aws_vpc" "app1" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.131.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "app1"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application2"
        }
      + tags_all                             = {
          + "Name"    = "app1"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application2"
        }
    }

  # tls_private_key.anvkey will be created
  + resource "tls_private_key" "anvkey" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_dns_name = (known after apply)
  + private_key = (sensitive value)
  + public_key  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @EvilStarr, Action: `pull_request`*